{
	"posts": [
		{
			"name": "Should You Test in Production?",
			"description": "Should You Test in Production? A lighthearted nod to every developer's worst (or best) idea, this site redirects to the iconic Bill O'Reilly clip: 'F*** it, we'll do it live!' Because sometimes, that's just how it feels. 😂",
			"link": "/blog/should-you-test-your-code-in-production/",
			"platform": ["Web"],
			"image": "/assets/images/blog/test-in-production.png"
		},
		{
			"name": "What Happens When Redbox Shuts Down? Trying the Redbox Free DVD Hack",
			"description": "With Redbox shutting down, I tested a curious hack, accessing a kiosk in offline mode to see if DVDs could be rented for free. Dive into what I discovered about Redbox’s kiosks, their connection issues, and how they function when the servers go down.",
			"link": "/blog/testing-redbox-kiosk-offline-hack-for-free-dvds/",
			"platform": ["Update", "Hack"],
			"image": "/assets/images/blog/redbox.png"
		},
		{
			"name": "How to Ethically Hack Woobox Voting with Node.js and Puppeteer",
			"description": "Learn how to ethically automate voting on Woobox using Node.js and Puppeteer. This guide walks you through creating a voting script for educational purposes, exploring the mechanics of online voting and best practices for securing platforms.",
			"link": "/blog/ethically-hack-woobox-voting-node-puppeteer/",
			"platform": ["Update", "Guide"],
			"image": "/assets/images/blog/woobox.png"
		},
		{
			"name": "How to Change the Battery in an Apple AirTag",
			"description": "Learn how to easily replace the battery in your Apple AirTag with this simple guide. We'll walk you through each step so you can keep your AirTag working smoothly and your items safely tracked.",
			"link": "/blog/how-to-change-battery-in-an-apple-airtag/",
			"platform": ["Social", "Guide"],
			"image": "/assets/images/blog/airtag.png"
		},

		{
			"name": "How to Delete or Deactivate Your Facebook Account ",
			"description": "Learn how to easily delete or deactivate your Facebook account with this simple, step-by-step guide. Whether you're taking a break or leaving for good, we’ve got you covered!",
			"link": "/blog/how-to-delete-or-deactivate-your-facebook-account/",
			"platform": ["Social", "Guide"],
			"image": "/assets/images/blog/facebook.png"
		}
,
		{
			"name": "How to Replace the Battery in Your Nintendo Switch",
			"description": "Is your Nintendo Switch not holding its charge like it used to? It's probably time to replace that battery. While it might sound tricky, I'll walk you through every single step, with detailed instructions on the screws and parts you'll encounter along the way!",
			"link": "/blog/how-to-replace-the-battery-in-your-nintendo-switch/",
			"platform": ["Social", "Guide"],
			"image": "/assets/images/blog/switch-battery.png"
		}

		,
		{
			"name": "ProcrastiNOT Update - The Maths Challenge is Here! 🎉",
			"description": "We’re excited to roll out a fresh new update for ProcrastiNOT, bringing in a fun twist and some polish to keep things sharp. Let’s break down what’s new!",
			"link": "/blog/procrastinot-maths-challenge-update/",
			"platform": ["Update", "Guide"],
			"image": "/assets/images/blog/maths-update.png"
		}


		
	]
}
